# Pair Programming Limpieza I

In [1]:
import pandas as pd
pd.options.display.max_columns = None

In [2]:
df = pd.read_csv('../datos/datos_ataques.csv', index_col= 0)
df.head(1)

,case_number,year,type,country,area,location,activity,name,age,time,species_,href,injury,date,mes,fatal,sexo
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018,Jun,n,F

Antes de seguir, recordamos las preguntas que nos planteamos al principio del pair programming de EDA para dirigir nuestro análisis.

- ¿Es Australia es el sitio más peligroso y letal para estar relajada en la playa?: country, case_number, fatal
- ¿Cuál es el rango de edad que sufre la mayoría de los ataques?: age
- Independientemente de la edad, sufren los hombres más ataques que las mujeres?: sexo
- ¿En qué mes ocurren más ataques?: mes
- ¿Cuál es la relación entre la especie y el tipo de ataque (si es fatal o no)?: species_
- ¿Cómo han evolucionado los ataques a lo largo del tiempo?: year
- De todo esto, nos damos cuenta que solo tenemos que limpiar algunas de las columnas, en concreto age, species, country, fatal, year, sex. Si reducimos esto a una tabla para saber que tenemos ya limpito y que no:

In [3]:
df.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'age', 'time', 'species_', 'href', 'injury', 'date',
       'mes', 'fatal', 'sexo'],
      dtype='object')

In [4]:
df_copia = df.copy()

In [5]:
df_drop = df_copia.drop(['case_number','type', 'area', 'location', 'activity', 'name', 'time', 'href', 'injury'], axis = 1) 

#Nos quedamos con las columnas que nos sirven para responder a nuestras hipótesis y eliminamos el resto.

df_drop.head(2)

     year country age     species_         date  mes fatal sexo
0  2018.0     USA  57  White shark  25-Jun-2018  Jun     n    F
1  2018.0  BRAZIL  18  Tiger shark  03-Jun-2018  Jun     y    M

2. ¿Hay valores duplicados en nuestro dataframe? En caso de que los haya, eliminándlos

In [6]:
df_drop[df_drop.duplicated(['country', 'year', 'age','species_','date','mes','fatal','sexo'])].head(10)

,year,country,age,species_,date,mes,fatal,sexo
1634,0.0,IRAN,NaN,NaN,1941-1945,NaN,y,M
1642,0.0,PAPUA NEW GUINEA,NaN,NaN,World War II,WorldWarII,n,M
1654,0.0,VIETNAM,NaN,NaN,Before 1911,Before,n,M
1656,0.0,SOUTH AFRICA,NaN,NaN,Before 1921,Before,y,M
1664,0.0,AUSTRALIA,NaN,Blue pointer,Before 1906,Before,y,M
1668,0.0,AUSTRALIA,NaN,NaN,Before 1903,Before,y,M

In [7]:
df_drop.drop_duplicates(inplace=True) #Eliminamos los duplicados

In [8]:
df_drop.duplicated().sum() #Comprobamos que no que ninguno

0

3. Como hemos visto, algunas columnas no tienen el tipo de datos que deberían. Cambiad el tipo de dato para la columna de year.

In [9]:
df_drop['year'].dtypes

dtype('float64')

In [10]:
df_drop['year'] = df_drop['year'].astype('Int64', errors = 'raise')

#Cambiamos de float a integer. Con el parámetro 'raise', en caso de que produzca un error se lanzará una excepeción y se parará la ejecución del código 
#Si puusiéramos 'ignore' el error se ignora y se devuelve el valor original)

In [11]:
df_drop['year'].dtypes #Comprobamos el tipo de dato que tenemos ahora

Int64Dtype()

In [12]:
df_drop["year"].unique()

<IntegerArray>
[2018, 2017, 2016, 2015, 2014, 2013, 2012, 2011, 2010, 2009,
 ...
 1617, 1595, 1580, 1555, 1554, 1543,  500,   77,    5,    0]
Length: 147, dtype: Int64

4. En la columna de country poner todos los valores en minúsculas.
💡 Pista Tendréis que usar una función o una lambda 💡

In [13]:
df_drop['country'].dtypes

dtype('O')

In [14]:
df_drop['country'] = df_drop['country'].apply(lambda x: x.lower() if type (x) == str else str (x)) #Aplicamos una función lambda para cambiar todos nuestros strings a minúsculas

In [15]:
df_drop.head() #Comprobamos el resultado

   year    country age          species_         date  mes fatal sexo
0  2018        usa  57       White shark  25-Jun-2018  Jun     n    F
1  2018     brazil  18       Tiger shark  03-Jun-2018  Jun     y    M
2  2018        usa  15    Bull shark, 6'  26-May-2018  May     n    M
3  2018  australia  32   Grey reef shark  24-May-2018  May     n    M
4  2018    england  21  Invalid incident  13-May-2018  May     n    M

In [16]:
df_drop.to_csv('datos_limpiezaI.csv', index = 'false') #Guardamos los datos